bench/reproducible/results/20260524Tphase3-json-final/raw/actix-latency-json-serialize-warmup.txt
Running 15s test @ http://127.0.0.1:13403/json-serialize
  4 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   246.11us  493.80us   9.85ms   92.43%
    Req/Sec   174.49k    43.72k  227.72k    50.25%
  Latency Distribution
     50%   97.00us
     75%  154.00us
     90%  530.00us
     99%    2.68ms
  10466874 requests in 15.10s, 1.32GB read
Requests/sec: 693175.61
Transfer/sec:     89.24MB